src/InformationRegisters/ИгровоеВремяКампаний/ИгровоеВремяКампаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИгровоеВремяКампаний</name>
  <resources>
    <name>ИгроваяМинута</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Кампания</name>
    <type>
      <types>CatalogRef.Кампании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ИгровоеВремя/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Прикладная логика работы с игровым временем кампаний.
// Все операции чтения и записи регистра ИгровоеВремяКампаний
// должны выполняться через данный модуль, чтобы UI и будущий AI-слой
// не обращались к регистру напрямую.
//

#Область ПрограммныйИнтерфейс

// Возвращает текущее игровое время активной кампании в игровых минутах.
// Если запись для активной кампании отсутствует - возвращает Неопределено.
//
// Возвращаемое значение:
//  Число, Неопределено - игровое время в минутах или Неопределено, если не задано.
//
Функция ПолучитьТекущееВремя() Экспорт

	Кампания = АктивнаяКампания();

	Если НЕ ЗначениеЗаполнено(Кампания) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнена активная кампания. Операция недоступна.'");
	КонецЕсли;

	Возврат ПрочитатьИгровуюМинуту(Кампания);

КонецФункции

// Устанавливает текущее игровое время активной кампании.
// Значение должно быть целым неотрицательным числом.
//
// Параметры:
//  ИгроваяМинута - Число - игровое время в минутах.
//
Процедура УстановитьТекущееВремя(ИгроваяМинута) Экспорт

	Кампания = АктивнаяКампания();

	Если НЕ ЗначениеЗаполнено(Кампания) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнена активная кампания. Операция недоступна.'");
	КонецЕсли;

	ПроверитьИгровуюМинуту(ИгроваяМинута);

	ЗаписатьИгровуюМинуту(Кампания, ИгроваяМинута);

КонецПроцедуры

// Изменяет текущее игровое время активной кампании на указанное
// количество минут. Допускается как положительное, так и отрицательное
// смещение, но итоговое игровое время не должно стать отрицательным.
//
// Параметры:
//  КоличествоМинут - Число - смещение игрового времени в минутах (может быть отрицательным).
//
Процедура ИзменитьВремя(КоличествоМинут) Экспорт

	Кампания = АктивнаяКампания();

	Если НЕ ЗначениеЗаполнено(Кампания) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнена активная кампания. Операция недоступна.'");
	КонецЕсли;

	ТекущееВремя = ПрочитатьИгровуюМинуту(Кампания);

	Если ТекущееВремя = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Игровое время активной кампании не инициализировано.'");
	КонецЕсли;

	НовоеВремя = ТекущееВремя + КоличествоМинут;

	Если НовоеВремя < 0 Тогда
		ВызватьИсключение НСтр("ru = 'Итоговое игровое время не может быть отрицательным.'");
	КонецЕсли;

	ЗаписатьИгровуюМинуту(Кампания, НовоеВремя);

КонецПроцедуры

// Чистая функция: возвращает результат добавления к игровому времени
// указанного количества минут. Не обращается к базе данных.
//
// Параметры:
//  ИгроваяМинута - Число - исходное игровое время в минутах.
//  Количество    - Число - количество добавляемых минут.
//
// Возвращаемое значение:
//  Число - игровое время в минутах после добавления.
//
Функция ДобавитьМинуты(ИгроваяМинута, Количество) Экспорт

	Возврат ИгроваяМинута + Количество;

КонецФункции

// Чистая функция: возвращает результат добавления к игровому времени
// указанного количества часов. Не обращается к базе данных.
//
// Параметры:
//  ИгроваяМинута - Число - исходное игровое время в минутах.
//  Количество    - Число - количество добавляемых часов.
//
// Возвращаемое значение:
//  Число - игровое время в минутах после добавления.
//
Функция ДобавитьЧасы(ИгроваяМинута, Количество) Экспорт

	Возврат ИгроваяМинута + Количество * 60;

КонецФункции

// Чистая функция: возвращает результат добавления к игровому времени
// указанного количества дней. Не обращается к базе данных.
//
// Параметры:
//  ИгроваяМинута - Число - исходное игровое время в минутах.
//  Количество    - Число - количество добавляемых дней.
//
// Возвращаемое значение:
//  Число - игровое время в минутах после добавления.
//
Функция ДобавитьДни(ИгроваяМинута, Количество) Экспорт

	Возврат ИгроваяМинута + Количество * 24 * 60;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает активную кампанию из параметров сеанса.
//
// Возвращаемое значение:
//  СправочникСсылка.Кампании
//
Функция АктивнаяКампания()

	Возврат ПараметрыСеанса.АктивнаяКампания;

КонецФункции

// Читает игровое время кампании из регистра сведений.
//
// Параметры:
//  Кампания - СправочникСсылка.Кампании
//
// Возвращаемое значение:
//  Число, Неопределено - игровое время в минутах, либо Неопределено, если запись отсутствует.
//
Функция ПрочитатьИгровуюМинуту(Кампания)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кампания", Кампания);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИгровоеВремяКампаний.ИгроваяМинута КАК ИгроваяМинута
		|ИЗ
		|	РегистрСведений.ИгровоеВремяКампаний КАК ИгровоеВремяКампаний
		|ГДЕ
		|	ИгровоеВремяКампаний.Кампания = &Кампания";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.ИгроваяМинута;

КонецФункции

// Создает или обновляет запись игрового времени для указанной кампании.
//
// Параметры:
//  Кампания      - СправочникСсылка.Кампании
//  ИгроваяМинута - Число - игровое время в минутах.
//
Процедура ЗаписатьИгровуюМинуту(Кампания, ИгроваяМинута)

	НаборЗаписей = РегистрыСведений.ИгровоеВремяКампаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Кампания.Установить(Кампания);

	Запись = НаборЗаписей.Добавить();
	Запись.Кампания = Кампания;
	Запись.ИгроваяМинута = ИгроваяМинута;

	НаборЗаписей.Записать();

КонецПроцедуры

// Проверяет корректность значения игрового времени: число, целое, неотрицательное.
//
// Параметры:
//  ИгроваяМинута - Число
//
Процедура ПроверитьИгровуюМинуту(ИгроваяМинута)

	Если ТипЗнч(ИгроваяМинута) <> Тип("Число") Тогда
		ВызватьИсключение НСтр("ru = 'Значение игрового времени должно быть числом.'");
	КонецЕсли;

	Если ИгроваяМинута < 0 Тогда
		ВызватьИсключение НСтр("ru = 'Значение игрового времени не может быть отрицательным.'");
	КонецЕсли;

	Если Цел(ИгроваяМинута) <> ИгроваяМинута Тогда
		ВызватьИсключение НСтр("ru = 'Значение игрового времени должно быть целым числом.'");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
